In [1]:
import pandas as pd
import numpy as np

In [2]:
city_data = {
"City": ["New York City", "Paris", "Barcelona", "Rome"],
"Country": ["United States", "France", "Spain", "Italy"],
"Population": [8600000, 2141000, 5515000, 2873000]
}

cities = pd.DataFrame(city_data)
cities

            City        Country  Population
0  New York City  United States     8600000
1          Paris         France     2141000
2      Barcelona          Spain     5515000
3           Rome          Italy     2873000

In [ ]:
cities.transpose() #inverteu as colunas e linhas

                        0        1          2        3
City        New York City    Paris  Barcelona     Rome
Country     United States   France      Spain    Italy
Population        8600000  2141000    5515000  2873000

In [9]:
random_data = np.random.randint(1, 101, [3,5])
random_data

array([[62, 30, 55, 85, 19],
       [75, 14, 73, 76, 58],
       [96, 53, 44, 76, 24]])

In [10]:
random = pd.DataFrame(random_data)
random

    0   1   2   3   4
0  62  30  55  85  19
1  75  14  73  76  58
2  96  53  44  76  24

In [12]:
row_labels = ['Morning', 'Afternoon', 'Evening']
temperatures = pd.DataFrame(data=random_data, index=row_labels)
temperatures

            0   1   2   3   4
Morning    62  30  55  85  19
Afternoon  75  14  73  76  58
Evening    96  53  44  76  24

In [13]:
column_labels = (
"Monday",
"Tuesday",
"Wednesday",
"Thursday",
"Friday",
)

In [14]:
pd.DataFrame(data=random_data, index=row_labels, columns=column_labels)

           Monday  Tuesday  Wednesday  Thursday  Friday
Morning        62       30         55        85      19
Afternoon      75       14         73        76      58
Evening        96       53         44        76      24

In [ ]:
row_labels = ["Morning", "Afternoon", "Morning"]
column_labels = [
"Monday",
"Tuesday",
"Wednesday",
"Tuesday",
"Friday"
]

pd.DataFrame(data=random_data, index=row_labels, columns=column_labels) #O pandas aceita ter índices de rótulos duplicados

           Monday  Tuesday  Wednesday  Tuesday  Friday
Morning        62       30         55       85      19
Afternoon      75       14         73       76      58
Morning        96       53         44       76      24

In [16]:
pd.read_csv('nba.csv')

               Name                 Team Position  Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG   9/26/96   1445697
1    Christian Wood      Detroit Pistons       PF   9/27/95   1645357
2     PJ Washington    Charlotte Hornets       PF   8/23/98   3831840
3      Derrick Rose      Detroit Pistons       PG   10/4/88   7317074
4     Marial Shayok   Philadelphia 76ers        G   7/26/95     79568
..              ...                  ...      ...       ...       ...
445   Austin Rivers      Houston Rockets       PG    8/1/92   2174310
446     Harry Giles     Sacramento Kings       PF   4/22/98   2578800
447     Robin Lopez      Milwaukee Bucks        C    4/1/88   4767000
448   Collin Sexton  Cleveland Cavaliers       PG    1/4/99   4764960
449     Ricky Rubio         Phoenix Suns       PG  10/21/90  16200000

[450 rows x 5 columns]